УТ/src/Documents/CRM_ШаблонЭтапаКалендарногоПлана/CRM_ШаблонЭтапаКалендарногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_ШаблонЭтапаКалендарногоПлана</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Свободное описание этапа</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смещение</name>
    <comment>Смещение (дней) от плановой даты начала проекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеОтЗадачи</name>
    <comment>Смещение (дней) от предыдущей задачи проекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Наименование задачи / контрольной точки  проекта</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭтапа</name>
    <type>
      <types>EnumRef.CRM_ТипыЭтапов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПроекта</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтапаПроекта</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныЭтаповПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВШаблоне</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <comment>Участники и ответственные по задаче/контрольной точке</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <comment>Признак ответственного</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВариантыКонтекстаФайлов</name>
    <attributes>
      <name>ВариантКонтекстаФайлов</name>
      <type>
        <types>CatalogRef.CRM_ВариантыКонтекстаФайла</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ/src/Documents/CRM_ШаблонЭтапаКалендарногоПлана/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	CRM_ОбщегоНазначенияСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	ЗаполнитьРеквизитыПоУмолчанию();
	
	Если НЕ ЗначениеЗаполнено(ШаблонПроекта) И ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.CRM_ШаблоныПроектов") Тогда
		ШаблонПроекта = ДанныеЗаполнения;
	КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.Свойство("ТипЭтапа") И ТипЭтапа = Перечисления.CRM_ТипыЭтапов.Этап Тогда
			ПродолжительностьДней = 1;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Описание = "";
	Автор = CRM_ОбщегоНазначенияСервер.ТекущийПользователь();
	ЗаполнитьРеквизитыПоУмолчанию();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ЗаполнитьСписокУчастников();
	
	Если ТипЭтапа = Перечисления.CRM_ТипыЭтапов.КонтрольнаяТочка Тогда	
		ПродолжительностьДней  = 0;
	ИначеЕсли ТипЭтапа = Перечисления.CRM_ТипыЭтапов.Этап И ПродолжительностьДней = 0 Тогда
		ПродолжительностьДней = 1;
	КонецЕсли;
	
	// Минимизируем процедуру обновления дат пакетов задач.
	Если Смещение <> Ссылка.Смещение Или ШаблонЭтапаПроекта <> Ссылка.ШаблонЭтапаПроекта
		 Или ПометкаУдаления <> Ссылка.ПометкаУдаления
		 Или ПродолжительностьДней <> Ссылка.ПродолжительностьДней Тогда
		
		ДополнительныеСвойства.Вставить("ОбновитьСмещенияШаблонаЭтапа", Истина);
		Если ШаблонЭтапаПроекта <> Ссылка.ШаблонЭтапаПроекта Тогда
			ДополнительныеСвойства.Вставить("ПредыдущийШаблонЭтапа", Ссылка.ШаблонЭтапаПроекта);
		КонецЕсли;
		
	КонецЕсли;
	
	// Смещение от задачи
	Если НЕ ДополнительныеСвойства.Свойство("НеПересчитыватьДеревоШаблонаПроекта")
		И (СмещениеОтЗадачи <> Ссылка.СмещениеОтЗадачи
		ИЛИ ШаблонЭтапаПроекта <> Ссылка.ШаблонЭтапаПроекта
		ИЛИ ШаблонПроекта <> Ссылка.ШаблонПроекта
		ИЛИ ПорядокВШаблоне <> Ссылка.ПорядокВШаблоне
	 	ИЛИ ПометкаУдаления <> Ссылка.ПометкаУдаления) Тогда
		
		ДополнительныеСвойства.Вставить("СмещениеОтЗадачиИзменено");
		
		Если ШаблонПроекта <> Ссылка.ШаблонПроекта Тогда
			ДополнительныеСвойства.Вставить("ПредыдущийШаблонПроекта", Ссылка.ШаблонПроекта);
		КонецЕсли;
		
		Если ШаблонЭтапаПроекта <> Ссылка.ШаблонЭтапаПроекта Тогда
			ДополнительныеСвойства.Вставить("ПредыдущийШаблонЭтапа", Ссылка.ШаблонЭтапаПроекта);
		КонецЕсли;
		
	КонецЕсли;
	
	// Следующий блок должен быть в обработчике ПередЗаписью, а не ПриЗаписи,
	// чтобы успешно обновить Смещение после пересчета дерева.
	Если ДополнительныеСвойства.Свойство("СмещениеОтЗадачиИзменено") Тогда
		
		ДанныеИсключаемогоЭтапа = Новый Структура("Этап, ШаблонЭтапаПроекта, ШаблонПроекта, СмещениеОтЗадачи, Смещение, ПометкаУдаления, ПорядокВШаблоне",
													Ссылка, ШаблонЭтапаПроекта, ШаблонПроекта, СмещениеОтЗадачи, Смещение, ПометкаУдаления, ПорядокВШаблоне);
		
		CRM_УправлениеПроектамиСервер.ПересчитатьДеревоШаблонаПроекта(ШаблонПроекта, ДанныеИсключаемогоЭтапа);
		Если ЗначениеЗаполнено(ШаблонЭтапаПроекта) И ШаблонЭтапаПроекта.ШаблонПроекта <> ШаблонПроекта Тогда
			CRM_УправлениеПроектамиСервер.ПересчитатьДеревоШаблонаПроекта(ШаблонЭтапаПроекта.ШаблонПроекта, ДанныеИсключаемогоЭтапа);
		КонецЕсли;
		
		ПредыдущийШаблонПроекта = Неопределено;
		Если ДополнительныеСвойства.Свойство("ПредыдущийШаблонПроекта") Тогда
			ПредыдущийШаблонПроекта = ДополнительныеСвойства.ПредыдущийШаблонПроекта;
			CRM_УправлениеПроектамиСервер.ПересчитатьДеревоШаблонаПроекта(ПредыдущийШаблонПроекта, ДанныеИсключаемогоЭтапа);
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("ПредыдущийШаблонЭтапа")
			И ЗначениеЗаполнено(ДополнительныеСвойства.ПредыдущийШаблонЭтапа)
			И ДополнительныеСвойства.ПредыдущийШаблонЭтапа.ШаблонПроекта <> ПредыдущийШаблонПроекта
			И ДополнительныеСвойства.ПредыдущийШаблонЭтапа.ШаблонПроекта <> ШаблонПроекта Тогда
			CRM_УправлениеПроектамиСервер.ПересчитатьДеревоШаблонаПроекта(ДополнительныеСвойства.ПредыдущийШаблонЭтапа.ШаблонПроекта,
																			ДанныеИсключаемогоЭтапа);
		КонецЕсли;
																		
		Смещение = ДанныеИсключаемогоЭтапа.Смещение;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ОбновитьСмещенияШаблонаЭтапа") Тогда
		// Обновим все даты пакета задачи и всех родителей этого пакета (если даты были изменены).
		Если ЗначениеЗаполнено(ШаблонЭтапаПроекта) Тогда
			CRM_УправлениеПроектамиВызовСервера.ОбновитьСмещенияШаблонаЭтапаИВсехРодителей(ШаблонЭтапаПроекта);
		КонецЕсли;
		Если ДополнительныеСвойства.Свойство("ПредыдущийШаблонЭтапа")
			 И ЗначениеЗаполнено(ДополнительныеСвойства.ПредыдущийШаблонЭтапа) Тогда
			CRM_УправлениеПроектамиВызовСервера.ОбновитьСмещенияШаблонаЭтапаИВсехРодителей(ДополнительныеСвойства.ПредыдущийШаблонЭтапа);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьРеквизитыПоУмолчанию()
	Дата = ТекущаяДатаСеанса();
КонецПроцедуры

// Процедура заполняет список участников мероприятия
//
// Параметры: Нет
//
Процедура ЗаполнитьСписокУчастников() Экспорт
	
	СписокУчастников = "";
	Для Каждого Участник Из Участники Цикл
		СписокУчастников = СписокУчастников + ?(СписокУчастников = "", "", "; ") + Участник.Пользователь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
